package com.example.rawanziadat.med2.dummy.dummy;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

/**
 * Helper class for providing sample content for user interfaces created by
 * Android template wizards.
 * <p>
 * TODO: Replace all uses of this class before publishing your app.
 */
public class DummyContent {

    /**
     * An array of sample (dummy) items.
     */
    public static final List<DummyItem> ITEMS = new ArrayList<DummyItem>();

    /**
     * A map of sample (dummy) items, by ID.
     */
    public static final Map<String, DummyItem> ITEM_MAP = new HashMap<String, DummyItem>();

    private static final int COUNT = 25;

    static {
        addItem(createDummyItem("id1","כאב ראש","הבדיקות שיש לבצע\n" +
                "בדיקה פיסיקאלית\n" +
                "דם: תפקודי קרישה, ספירה\n" +
                "הפנייה ל: נוירולוג\n\n שאלות הבהרה" +
                "\n" +
                "האם נחבל\\ה בראש לאחרונה?\n" +
                "האם ישנן מחלות רקע?\n" +
                "האם ישנו קושי בראייה?\n" +
                "האם יש שימוש בעזרי ראייה?\n" +
                "האם משתמש בתרופות?\n" +
                "האם חש בעייפות ו\\או ישנוניות?\n" +
                "האם חש בחילה ו\\או הקאה?\n\n" +
                "הסימפטום\n" +
                "כאבי ראש חזקים ", "headace"));
        addItem(createDummyItem("id2","היפרגלקמיה","הבדיקות שיש לבצע\n" +
                "סימנים חיוניים (ל\"ד)\n" +
                "שתן: כללית ותרבית\n" +
                "דם: כימיה, ספירה, תפקודי כבד, תפקודי כליות, כולסטרול,פרופיל שומנים \n \n " +
                "שאלות לבירור\n" +
                "האם ישנו רקע של סכרת?\n" +
                "האם נוטל תרופות המעלות את רמת הסוכר בדם (חוסמי ביטא, תיאזידים, קורטיקוסטרואידים, תרופות אנטיפסיכוטיות אטיפיות, Pentamidine (טיפול ב-PCP – דלקת ריאות)?\n" +
                "האם חש\\ה בצימאון מוגבר ויובש בפה?\n" +
                "האם ישנה השתנה מרובה?\n" +
                "האם יש הופעה של פטריות וזיהומים אחרים באברי מין (בנשים)?\n" +
                "האם בהריון?\n" +
                "האם חלה ירידה גדולה במשקל לאחרונה?\n" +
                "האם הופיע טשטוש ראייה?\n" +
                "האם יש תחושה של ישנוניות ו\\או עייפות?\n\n" +
                "הגדרה\n" +
                "היפרגליקמיה", "dam"));
        addItem(createDummyItem("id3","היפוגלקמיה","הבדיקות שיש לבצע\n" +
                "דם: תרבית, שקיעה, תפקודי כבד, תפקודי כליה, רמת גלוקוז\n" +
                "סימנים חיוניים (ל\"ד, דופק)\n\nשאלות אנמנזה\t\n" +
                "האם ישנן מחלות רקע? (סכרת, אונקולוגיות, לב, אי תפקודי כליה?)\t\n" +
                "האם נוטל תרופות? (אינסולין, חוסמי בטא, ACEI, ARB, אנטיביוטיקה ממשפחת הקינולונים?)\t\n" +
                "מצב הכרתי? (בלבול, תשישות, עצבנות, חרדה, פרכוסים)\t\n" +
                "האם יש הופעה של רעד בידיים?\t\n" +
                "הופעה של פלפיטציות?\t\n" +
                "האם שותה אלכוהול?\t\n" +
                "האם יש הופעה של רעב עז?\t\n" +
                "האם ישנה הופעה של הזעה מוגברת?\t\n" +
                "האם יש תחושת נמלול בקצוות? (רגליים, ידיים, לשון)\t\n" +
                "האם ישנה הופעה של עייפות ו\\או ישנוניות?\n\n" +
                "סימפטום\n" +
                "היפוגליקמיה", "dam"));
        addItem(createDummyItem("id4","הרעלה","הבדיקות שיש לבצע\n" +
                "סימנים חיוניים\n" +
                "אומדן נשימתי\n" +
                "דם: כימיה, ספירה, תרבית, רמת תרופה בדם (במידה ונוטל תרופות), רמת אלכוהול בדם (במידה ושותה אלכוהול)\n" +
                "צואה: תרבית\n" +
                "שתן: תרבית, כללית\n" +
                "אק\"ג\n\nשאלות להבהרה\n" +
                "האם הייתה גישה לא מבוקרת לחומרי ניקוי?\n" +
                "האם נעשה ריסוס בסביבת המחייה לאחרונה?\n" +
                "האם ישנה הופעה של כוויות מסביב לפה?\n" +
                "הופעה מרובה של נזלת, הפרשת רוק, ודמעות?\n" +
                "הופעה של שלשולים?\n" +
                "האם ישנה הופעה של בחילות ו\\או הקאות?\n" +
                "האם שותה אלכוהול?\n" +
                "מה אכל\\ה לאחרונה?\n" +
                "האם נטל\\ה תרופות בצורה אקססיבית?\n\nהסימפטום\n" +
                "הרעלה", "shel"));
        addItem(createDummyItem("id5","חום גבוה","הבדיקות שיש לבצע\n" +
                "דם: ספירה, שקיעת דם, תפקודי כבד, תפקודי כליות, וירולוגיה\n" +
                "שתן: תרבית וכללית\n\n" +
                "הפנייה אפשרית ל: נוירולוג, פנימאי.\n\nשאלות לבירור\n" +
                "כמה ימים נמשך החום?\n" +
                "האם מתמתן בלקיחת תרופות להורדת חום?\n" +
                "האם גבוה באופן קבוע או עולה ויורד לסירוגין?\n" +
                "האם ישנם כאבים בחזה, קושי בנשימה, שיעול?\n" +
                "האם ישנה רגישות בבטן?\n" +
                "האם ישנה הופעה של פריחה\\אודם?\n" +
                "האם ישנם שינויים במצב ההכרה?\n" +
                "האם ישנם כאבי פרקים?\n\nהסימפטום\n" +
                "חום גבוה מעל כמה ימים" , "headace"));
        addItem(createDummyItem("id6","קוצר נשימה","בדיקות לביצוע\n" +
                "1.סימנים חיוניים-ל\"ד, דופק,סטורציה,חום\n" +
                "2.הסתכלות על בית חזה- הפעלת שרירי הנשימה,\n" +
                "3. האזנה לבית חזה- חרחורים, צפצופים, קולות לב מופחתים\n" +
                "4. התרשמות מהמטופל- בצקתי\\ חיוור,מבולבל, באי שקט, שרירי הצוואר בולטים, נחירי האף מורחבים\n" +
                "5. אק\"ג\n\nשאלות לבירור\n" +
                "מתי החל- בוקר, לילה (בזמן ניסיון להירדם), עכשיו\n" +
                "כמה זמן ארך-  דקות, שעות, ימים\n" +
                "גורמים מקלים- ישיבה\n" +
                "גורמים מחמירים- שכיבה\n" +
                "תלונות נלוות- קושי להשלים משפט שלם,  כאבים בחזה (בעת שאיפת אויר), התנפחות בפנים , גרד, נפיחות של העור,  כחלון, בלבול.\n" +
                "האם את\\ה סובל\\ת מחרדה- כן, לא\n" +
                "האם שאפת גוף זר (מטבע, גרעין, אוכל)- כן, לא\n" +
                "היסטוריה רפואית רלוונטית- אסטמה, COPD, אלרגיות, חרדה, אין היסטורה רלוונטית.\n\nהגדרה\n" +
                "קוצר נשימה", "sed"));
        addItem(createDummyItem("id7","סחרחרת","בדיקות לביצוע\n" +
                "1.סימנים חיוניים- ל\"ד, דופק, סטורציה, חום\n" +
                "2.בדיקת סוכר- גלוקומטר\n" +
                "3. סולם כאב ע\"י ואס.\n" +
                "4. בדיקות דם הכוללות- ספירה, המטולוגיה,\n" +
                "5. אק\"ג\n" +
                "6. התרשמות מהמטופל- חיוור, מתנשם, \n\nשאלות לבירור\n" +
                "כיצד החלה- בזמן קימה מהירה משכיבה לעמידה, בעת סיבוב במיטה, בכל ניסיון לזוז, להרים\\ לכופף את הראש.\n" +
                "כמה זמן ארכה- שניות, דקות, לעיתים שעות\n" +
                "האם ישנו שימוש באלכוהול או סמים- כן, לא\n" +
                "אילו תרופות קבועות נוטל- תרופות להורדת ל\"ד, אנטי פסיכותיות, אוטוטוקסיות\n" +
                "תלונות נלוות- כאב ראש, חום, כאב\\טנטון באוזניים, תחושת מלאות באוזניים ואובדן שמיעה, כפל ראיה, בחילות והקאות\n\nהגדרה\n" +
                "סחרחורות", "headace"));

        addItem(createDummyItem("id8","כאבים בחזה","בדיקות לביצוע\n" +
                "1.סימנים חיונים- ל\"ד, דופק, סטורציה\n" +
                "ספירה, כימיה, רמות טרופונין, רמות CK, גזים בדם,  תפקודי כליות, תפקודי קרישה, עמילאז\n" +
                "3. אק\"ג\n" +
                "\nשאלות לבירור\n\n" +
                "מיקום הכאב- חזה (צד ימין\\ שמאל), בטן עליונה, צוואר\n" +
                "סוג הכאב- דוקר, שורף, לוחץ, סוחט\n" +
                "משך הכאב- קבוע, חולף\n" +
                "גורמים מקלים- מנוחה, שכיבה, אין\n" +
                "גורמים מחמירים- מאמץ, אכילה, תנועה כלשהיא, מנוחה\n" +
                "האם הכאב מקרין- כן- ישנה הקרנה ליד\\  צוואר\\ לסת\\ גב , אין הקרנה\n" +
                "תלונות נלוות- כן-בחילות והקאות, צרבת, הזעות, חום, קוצר נשמה, דפיקות לב.\n" +
                "אין תלונות נוספות\n" +
                "היסטוריה רפואית רלוונטית-  התקף לב בעבר, אין היסטוריה רפואית רלוונטית\n\nהגדרה\n" +
                "כאבים בחזה\n", "sed"));
        addItem(createDummyItem("id9","כאב בטן תחתונה","איזה בדיקות יש לבצע?\n" +
                ".בדיקת בטן- לשים לב לסימני חבלה או ניתוח בעבר.\n" +
                "בדיקה אם הבטן תפוחה, אם יש נוכחות של נוזל\\ אויר.\n" +
                "לבדוק האם יש רגישות ישירה או מוקרנת.\n" +
                "חיפוש גושים\\ אוושות\\ קולות מעים\n" +
                "2. בדיקה רקטלית\n" +
                "3. בדיקת אגן אצל נשים\n" +
                "4. בדיקות דם הכוללות: ספירה מלאה, תפקודי קרישה, ריכוזי אלקטרוליטים, תפקודי כבד, כליות ולבלב.\n" +
                "\nשאלות לברור\n" +
                "מיקום הכאב-  בטן תחתונה ימנית,  שמאלית, איזור הטבור\n" +
                "משך הכאב-\n" +
                "סוג כאב- עוויתי (מקורו במעיים), לוחץ, שורף\n" +
                "הקרנה- למותן \\ מפשעה\n" +
                "גורמים מחמירים ומקלים- אכילה,  תדירות יציאה, הטלת שתן, וסת\n" +
                "תלונות נלוות- חום, צמרמורת, בחילות, הקאות, עצירות, שלשול, כאב בעת הטלת שתן, דם במתן שתן, הפרשה וגינלית  או הפרשה מהפין , צואה דמית.\n" +
                "היסטוריה רפואית רלוונטית- היסטוריה משפחתית של מחלות , היסטוריה משפחתית של- סכרת, דלקת קולגן, דיכאון, עישון, הפסקת עישון לא ממזמן, צריכת אתנול\n" +
                "\nהגדרה\n\n" +
                "כאב בטן תחתונה\n", "shel"));
        addItem(createDummyItem("id10","כאבי גב תחתון","בדיקות לביצוע\n" +
                "סימנים חיוניים: חום,דופק ל\"ד סטורציה\n" +
                "בדיקות דם כימיה וספירה שגרתיות\n\nשאלות לבירור\n" +
                "נשאל את סוג הכאב- ממוקם,מוקרן לגב, ממקור חוט השדרה, כאב רדיקרלי, כתוצאה מספאזם?\n" +
                "האם יש הסטוריה של זיהום כרוני?\n" +
                "האם יש אי שליטה על סוגרים?\n" +
                "האם היה טיפול בקורטקוסטרואידם?\n" +
                " האם יש רגישות בניקוש ?\n" +
                "האם יש גורמים ויסצראלים?\n" +
                "\nהגדרה\n\n" +
                "כאבי גב תחתון ללא סיפור חבלה\n" +
                "\n", "back"));
        addItem(createDummyItem("id11","אנפילקסיס","בדיקות לביצוע\n" +
                "סימנים חיוניים: ל\"ד,חום דופק וסטורציה\n" +
                "לרוב בדיקות מיוחדות לא נחוצות\n" +
                "במידה ולא מוצאים את הסיבה לאנפלקסיס אפשר לבצע תבחין אלרגיה\n" +
                "\nשאלות לבירור\n" +
                "מתי התחילה התגובה?\n" +
                "האם היתה חשיפה לאלרגן?(עקיצה\\חיסון\\מזון?\n" +
                "האם קיבלת תרופה\\ או עירוי דם לפני התגובה?\n" +
                "האם יש תסמיני נשימה כגון: נפיחות בריריות,צרידות,סטרידור, ברונכוספאזם?\n" +
                "האם יש תסמיני לב וכלי דם כגון:  טכקרדיה,תת לחץ דם\n" +
                "האם יש תסמיני עור כגון: אאורטיקה, אנגיודמה\n" +
                "\nהגדרה\n" +
                "אנפילקסיס-  היא תגובת רגישות יתר מערכתית ומסכנת חיים שמופיעה בעקבות חשיפה לאלרגן.\n", "do5a"));
        addItem(createDummyItem("id12","כאב בטן עליונה","איזה בדיקות יש לבצע?\n" +
                "סימנים חיוניים- ל.ד,דופק,סיטורציה,חום.\n" +
                "בדיקה גופנית , הסתכלות, מישוש בטן פריסטלטיקה\n" +
                "אק\"ג \n" +
                "בדיקות מעבדה דם ושתן (ספירת דם , כימיה , עמליז , תפקודי כליות , CRP)\n" +
                " הפנייה לרופא לצורך  גסטרוסקופיה , בדיקת נשיפה ,US בטן , CT בטן.\n" +
                "\nשאלות לברור\n\n" +
                "מיקום הכאב? בטן עליונה ימנית , שמאלית , רום הבטן.\n" +
                "סוג הכאב והאם הוא קבוע או חולף? האם הוא דוקר, שורף, לוחץ\n" +
                "מתי התחיל הכאב? וכמה זמן נמשך כבר?\n" +
                "גורמים מקלים? מנוחה, שכיבה, אכילה?\n" +
                "גורמים מחמירים?מאמץ, מנוחה, אכילה, תנועה כלשהי.\n" +
                "האם יש הקרנה של הכאב למקום אחר? כמו אזור הסרעפת?\n" +
                "האם יש תלונות נוספות כמו בחילות, הקאות, צרבת, הזעות, חום\n" +
                "קוצר נשימה, דימום מהרקטום.\n" +
                "האם יש היסטוריה רפואית של ניתוחים באזור הבטן או מחלות רקע רלוונטית.\n" +
                "הם יש רגישות למוצרי חלב או גלוטן? האם יש ששתיית אלכוהול מופרזת.\n" +
                "האם ישנם תרופות קבועות? כמו אספירין, NSIAD?\n" +
                "\nהגדרה\n\n" +
                "כאב בטן עליונה\n", "shel"));
        addItem(createDummyItem("id13","צריבה בשתן","למה?\n" +
                "כדי לדעת את מצבו הנוכחי של המטופל.\n" +
                "\n" +
                "לבדוק אם יש זיהום ולדעת איך לטפל בו\n" +
                "לבדוק אם זיהום עבר לדם\n" +
                "חשד לבעיה במערכת השתן העליונה\n" +
                "\nאיזה בדיקות יש לבצע?\n" +
                "סימנים חיוניים (לחץ דם, דופק, חום, סטורציה, כאב מ1 עד 10)\n" +
                "שתן בסטיק\n" +
                "תרבית שתן\n" +
                "תרבית דם \n" +
                "הפנייה לאולטראסאונד בטן\n" +
                "\nשאלות לברור\n" +
                "אנמנזה: מתי התחילה הצריבה, האם זאת פעם ראשונה? \n" +
                "מלווה בחום? צמרמורת? בחילה\\הקאה? שלשול? תכיפות? דחיפות? כאבי גב תחתון? UTI קודם?\n" +
                "האם יש הקרנה של הכאב?\n" +
                "האם יש קושי בהטלת שתן?\n" +
                "האם יש דם? האם השתן צלול או עכור? דמי? או מדיף ריח רע?\n" +
                "האם יש גורמים המקלים את הכאב?\n" +
                "האם יש הפרשה וגיאנלית או מהפין?\n" +
                "האם יש היסטוריה של אבנים בכליות? או גידול בערמונית?\n" +
                "האם יש צנתר שתן?\n" +
                "האם הייתה פעילות מינית בימים האחרונים?\n\nהגדרה\n" +
                "צריבה עזה בדרכי השתן\n" +
                "\n", "do5a"));
        addItem(createDummyItem("id14","פרכוסים","למה?\n" +
                "כדי לדעת את מצבו הנוכחי של המטופל\n" +
                "לשלילת סמים ו\\או תרופות\n" +
                "לשלילת היפוגליקמיה\n" +
                "לבדיקת הפעילות החשמלית של המוח\n" +
                "\nאיזה בדיקות יש לבצע?\n" +
                "סימנים חיוניים (לחץ דם, דופק, חום, סטורציה, כאב מ1 עד 10)\n" +
                "בדיקות דם לכימיה, ספירה, תפקודי כבד וכליות\n" +
                "סקר טוקסיקולוגי בדם ובשתן\n" +
                "סוכר בדם\n" +
                "במידה והחולה מאובחן כבר כחולה נירולוגי- פרכוסי לבדוק את רמות התרופה נגד פרכוס בדמו\n" +
                "הפנייה לmri/CT לשם שלילת ליקוי מבני \n" +
                "הפנייה ל EEG   \n" +
                "המשך בירור:\n" +
                "במידה ויש חשד למנינגיטיס-זימון רופא לביקת LP\n" +
                "\nהאם המטופל לוקח תרופות אשר עלולות להשרות פרכוסים\n" +
                "האם החולה פרכס בעבר?\n" +
                "מחלות רקע\n" +
                "\nהגדרה\n" +
                "פרכוס ( Seizure ) הוא אירוע התקפי המתאפיין בפעילות חשמלית בלתי תקינה, מוגברת ובו זמנית המתחוללת בתוך צבר נוירונים במערכת העצבים המרכזית.\n" +
                "בעת אירוע יש להניח את המטופל עם פניו מטה, כשראשו מוטה לצד לשם מניעת שאיפת תוכן קיבה אל הריאות. אין לנסות להכניס מגיני לשון או חפצים אחרים מנעד לשיניים חשוקות.\n" +
                "יש לספק חמצן בעזרת מסכה ולתקן במהירות האפשרית הפרעות מטבוליות הפיכות ", "do5a"));
        addItem(createDummyItem("id15","איבוד הכרה","למה\n" +
                "כדי לדעת את מצבו הנוכחי של המטופל ולשלול תת ל\"ד\n" +
                "חשד להיפוגליקמיה\n" +
                "חשד להיפרוונטילציה\n" +
                "לשלילת אירוע קורונרי\n" +
                "לבדיקת רמת המוגלובין בחשד לאנמיה\n" +
                "\nאיזה בדיקות יש לבצע?\n" +
                "סימנים חיוניים (לחץ דם, דופק, חום, סטורציה, כאב מ1 עד 10)\n" +
                "רמת סוכר בדם\n" +
                "מספר נשימות \n" +
                "ECG\n" +
                "בדיקות דם  כימיה וספירה \n" +
                "בדיקת תת לחץ דם תנוחתי\n" +
                "זימון רופא נירולוג וקרדיולוג במידת הצורך \n" +
                "\nשאלות לברור\n" +
                "האם  זוכר את האירוע?\n" +
                "האם היו סימנים מקדימים כמו חולשה, עילפון, \n" +
                "טשטוש ראייה, צלצול באוזניים או הזעה?\n" +
                "האם הוא נוטל תרופות ללחץ דם? או נוגדת דיכאון?\n" +
                "האם היו פרכוסים?\n" +
                "רקע של מחלות לב, סכרת או נירולוגי?\n" +
                "האם היה אירוע שגרם לחרדה?\n" +
                "האם יש כאבים בחזה?\n" +
                "\nהגדרה\n" +
                "איבוד הכרה הוא אובדן חולף של ההכרה ושל הטונוס \n" +
                "התנוחתי כתוצאה מירידה בזרימת הדם למוח \n", "do5a"));
        addItem(createDummyItem("id16","שלשול","למה?\n" +
                "כדי לדעת את מצבו הנוכחי של המטופל.\n" +
                "לראות אם השלשול דלקתי. אם יש עלייה ברמת הלויקוציטים, האם יש איבוד דם, אפשר לאבד הרבה בי-קרבונט,אשלגן, נתרן.\n" +
                "לאיתור אורגניזמים מזהמים או טפיליים, רעלניים חידקיים, דם, שומן.\nאיזה בדיקות יש לבצע?\n" +
                "סימנים חיוניים (לחץ דם, דופק, חום, סטורציה, כאב מ1 עד 10)\n" +
                "ספירת דם, אלקטרוליטים וכימיה\n" +
                "תרבית צואה\n" +
                "הפניה לרופא פנימאי\n" +
                "\nשאלות לברור\n" +
                "• מתי התחיל השלשול?\n" +
                "• האם מדובר במצב מתמשך או שמדובר בהתקפים?\n" +
                "• האם שינית דבר מה באורח החיים שלך?\n" +
                "• האם התחלת להשתמש בתרופות חדשות?\n" +
                "• והאם יש משהו ששמתם לב שעוזר למניעת השלשול?\n" +
                "• האם יש חום? אם כן, מה החום הכי גבוה שנמדד?\n" +
                "• האם חזרת מטיול בחו\"ל או מטיול בארץ ואכלתם או שתיתם מזון או מים מזוהמים?\n" +
                "• האם השלשול הוא גם בלילה או רק ביום?\n" +
                "האם יש דם ביציאה? מה צבע היציאה? האם היא רירית?\n" +
                "\nשלשול-הגדרה\n" +
                "תכיפות מוגברת של יציאות-יותר מ3 פעמים ביום\n" +
                "כמות גבוה של צואה (יותרמ200 גרם ליום)\n" +
                "שינוי מרקם -צואה נוזלית\n", "shel"));



    }

    private static void addItem(DummyItem item) {
        ITEMS.add(item);
        ITEM_MAP.put(item.id, item);
    }

    private static DummyItem createDummyItem(String str , String str2 , String str3 , String part ) {
        return new DummyItem(str, str2 , str3  ,part );
    }

    private static String makeDetails(int position) {
        StringBuilder builder = new StringBuilder();
        builder.append("Details about Item: ").append(position);
        for (int i = 0; i < position; i++) {
            builder.append("\nMore details information here.");
        }
        return builder.toString();
    }

    /**
     * A dummy item representing a piece of content.
     */
    public static class DummyItem {
        public final String id;
        public final String content;
        public final String details;
        public final String _part ;

        public DummyItem(String id, String content, String details ,String  part ) {
            this.id = id;
            this.content = content;
            this.details = details;
            this._part= part ;
        }

        @Override
        public String toString() {
            return content;
        }
    }
}
